---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyResolved
source: html/c106d36a-7f9a-408f-e4d9-8e36bb91bb13.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyResolved Property

There was a circular chain of references among the highlighted elements that was attempted to resolve. User-visible text will
 depend on original error returned by offending element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencyResolved { get; }
```